Repository: maykinmedia/mozilla-django-oidc-db
Catalog: mozilla_django_oidc_db/locale/*/LC_MESSAGES/django.po
Languages: nl

source: Activation
nl: Activering

source: Relying Party settings
nl: Instellingen voor Relying Party

source: Custom settings
nl: Eigen instellingen

source: Advanced settings
nl: Geavanceerde instellingen

source: claim path segment
nl: claimpadonderdeel

source: Something went wrong while retrieving the configuration.
nl: Er ging iets fout bij het ophalen van de configuratie.

source: This field is required.
nl: Dit veld is verplicht.

source: identifier
nl: identificatie

source: Unique identifier of the OIDC provider.
nl: Unieke identificatie van de OIDC-provider.

source: URL of your provider discovery endpoint ending with a slash (`.well-known/...` will be added automatically). If this is provided, the remaining endpoints can be omitted, as they will be derived from this endpoint.
nl: URL naar de discovery-endpoint van je identity provider. (`.well-known/...`wordt hier automatisch aan toegevoegd). Wanneer deze waarde opgegeven is, dan kan je de overige endpoint-velden leeg laten omdat ze automatisch gevuld zullen worden.

source: URL of your provider JSON Web Key Set endpoint. Required if `RS256` is used as signing algorithm.
nl: URL naar de endpoint waar de JSON Web Key Sets te vinden zijn. Deze is verplicht als het ondertekenalgoritme `RS256` is.

source: Authorization endpoint
nl: Autorisatie-endpoint

source: URL of your provider authorization endpoint
nl: URL naar de endpoint voor autorisatie van je provider.

source: URL of your provider token endpoint
nl: URL naar de endpoint om tokens te verkrijgen van je provider.

source: User endpoint
nl: Gebruikers-endpoint

source: URL of your provider userinfo endpoint.
nl: URL naar de endpoint om gebruikersgegevens op te halen.

source: Logout endpoint
nl: Uitlog-endpoint

source: URL of your provider logout endpoint.
nl: URL naar de endpoint om een sessie uit te loggen.

source: Use Basic auth for token endpoint
nl: Gebruik 'Basic auth' voor het token-endpoint

source: If enabled, the client ID and secret are sent in the HTTP Basic auth header when obtaining the access token. Otherwise, they are sent in the request body.
nl: Wanneer ingeschakeld, dan worden de client-ID en secret in de HTTP Basic auth header gecommuniceerd bij het ophalen van een acess token. Indien niet, dan worden ze in de request body opgestuurd.

source: Use nonce
nl: Gebruik nonce

source: Controls whether the client uses nonce verification
nl: Be√Ønvloed het gebruik van nonce-verificatie

source: Nonce size
nl: Nonce-grootte

source: Sets the length of the random string used for nonce verification
nl: Stel de lengte van de willekeurige string in voor nonce-verificatie

source: State size
nl: State-grootte

source: Sets the length of the random string used for state verification
nl: Stel de lengte van de willekeurige string in voor state-verificatie

source: Unique identifier for the client.
nl: Unieke identificatie voor de client.

source: enabled
nl: ingeschakeld

source: The client must be enabled before users can authenticate through it.
nl: De client moet ingeschakeld zijn voordat gebruikers ermee kunnen inloggen.

source: Specifies which OIDC Provider to use.
nl: Selecteer welke OIDC-Provider gebruikt wordt.

source: Client ID provided by the OIDC Provider
nl: Client-ID verstrekt door de OIDC-provider

source: Secret provided by the OIDC Provider
nl: Secret verstrekt door de OIDC-provider

source: Scopes that are requested during login
nl: (Autorisatie)-scopes die gevraagd worden tijdens het inloggen

source: OpenID sign algorithm
nl: OpenID ondertekenalgoritme

source: Algorithm the Identity Provider uses to sign ID tokens
nl: Het algoritme dat de Identity Provider gebruikt om ID-tokens te ondertekenen

source: Sign key
nl: Onderteken-sleutel

source: Key the Identity Provider uses to sign ID tokens in the case of an RSA sign algorithm. Should be the signing key in PEM or DER format.
nl: De sleutel die de Identity Provider gebruikt om ID-tokens te ondertekenen wanneer er een RSA-ondertekenalgoritme gebruikt wordt. Gebruik PEM of DER-formaat.

source: Specific for Keycloak: parameter that indicates which identity provider should be used (therefore skipping the Keycloak login screen).
nl: Optie specifiek voor Keycloak: een parameter die aangeeft welke identity provider in Keycloak gebruikt moet worden (waarmee het Keycloak loginscherm overgeslagen wordt).

source: user information claims extracted from
nl: gebruikersinformatie ophalen uit

source: Indicates the source from which the user information claims should be extracted. This can be the ID token or the User Info endpoint.
nl: Geef aan welke bron gebruikt moet worden voor het ophalen van gebruikersgegevens. Dit kan het ID-token zijn of een aanroep van de gebruikers-endpoint.

source: check OIDC Provider availability
nl: controleer beschikbaarheid OIDC-provider

source: Whether to check OIDC Provider availability before doing the authentication request.
nl: Indien ingeschakeld, dan wordt de beschikbaarheid van de OIDC-provider getest voor de gebruiker naar de loginpagina geleid wordt.

source: options
nl: opties

source: Options relevant for a specific Identity Provider.
nl: Opties relevant voor een specifieke Identity Provider.

source: OIDC Configuration options.
nl: OIDC-instellingen.

source: Settings for managing the local Django Users.
nl: Instellingen om lokale Django-gebruikers te beheren.

source: Mapping between the Django User model fields and a path to a claim value.
nl: Vertaling tussen Django-gebruikervelden en de waardelocaties in de claims.

source: Path to the claim to use as username.
nl: Locatie van de claim die de gebruikersnaam bevat.

source: Path to the claim to use as first name.
nl: Locatie van de claim die de voornaam bevat.

source: Path to the claim to use as last name.
nl: Locatie van de claim die de achternaam bevat.

source: Path to the claim to use as email.
nl: Locatie van de claim die het e-mailadres bevat.

source: Whether the username of the Django User is case sensitive. Defaults to true.
nl: Geeft aan of de gebruikersnaam van een gebruiker hoofdlettergevoelig is. Standaard ingeschakeld.

source: List of paths to values in the claims which are considered sensitive. The username claim is considered sensitive by default.
nl: Lijst van locaties in de claims waarvan de waarde als 'gevoelige informatie' beschouwd wordt. Standaard is de gebruikersnaam als gevoelig gemarkeerd.

source: Settings required to assign the created users to the right Django groups.
nl: Instellingen om gebruikers aan de juiste groepen toe te kennen.

source: Path to the claim value that contains the groups that the user should be a member of.
nl: Locatie van de claim die de groepen bevat waar de gebruiker lid van moet zijn.

source: Whether local Django user groups should be created for group names present in the groups claim (if they do not exist).
nl: Schakel in om lokale groepen aan te maken die aanwezigz ijn in de groepen-claim maar nog niet bestaan in de applicatie.

source: The glob pattern that local groups must match to be synchronised to the local database.
nl: Het patroon ('glob') waar groepsnamen aan moet voldoen om gesynchroniseerd te worden met de lokale databank.

source: Names of the groups to which every user logging in with OIDC will be assigned.
nl: Namen van groepen waaraan elke gebruiker die met OIDC inlogt automatisch toegekend wordt bij het inloggen.

source: Users will be flagged as being a staff user automatically. This allows users to login to the admin interface. By default they have no permissions, even if they are staff.
nl: Indien ingeschakeld worden gebruikers automatisch gemarkeerd met 'stafstatus' wat hun toelaat om in te loggen op de beheeromgeving. Standaard hebben ze geen rechten, zelfs met stafstatus.

source: If any of these group names are present in the claims upon login, the user will be marked as a superuser. If none of these groups are present the user will lose superuser permissions.
nl: Zodra √©√©n van deze groepsnamen aanwezig is in de groepen-claim wordt de gebruiker aangemerkt als 'supergebruiker' die alle rechten heeft. Indien geen enkele groep aanwezig is, dan verliest de gebruiker de supergebruiker-status.

source: Configuration for the OIDC Provider endpoints.
nl: Instellingen voor de OIDC-provider endpoints.

source: Mapping from User model field names to a path in the claim.
nl: Vertaling van gebruikersmodelvelden naar een locatie in de claims.

source: Path in the claims to the value to use as username.
nl: Locatie van de claim die de gebruikersnaam bevat.

source: Path in the claims to the value with group names.
nl: Locatie van de claim die de groepsnamen bevat.

source: Superuser group names
nl: Supergebruiker-groepsnamen

source: Default group names
nl: Standaard groepsnamen

source: Whether to sync local groups
nl: Lokale groepen synchroniseren

source: Pattern that the group names to sync should follow.
nl: Patroon waaraan de groepsnamen voor synchronisatie moeten voldoen.

source: Whether to make the users staff.
nl: Geef gebruikers stafstatus.

source: List of OIDC providers
nl: Lijst van OIDC-providers

source: There was an error while logging in with your organization account.
nl: Er deed zich een fout voor bij het inloggen met je organisatie-account.

source: There was a problem while logging in with your organization account. Please contact your administrator with this error message to resolve this:
nl: Er deed zich een fout voor bij het inloggen met je organisatie-account. Gelieve contact op te nemen met je beheerder en informeer hen van deze foutmelding om het probleem op te lossen:

source: Back to login
nl: Terug naar inloggen
